---
type: LayoutRuleMaximumSpacing
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# LayoutRuleMaximumSpacing

`Autodesk.Revit.DB.LayoutRuleMaximumSpacing` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | LayoutRuleMaximumSpacing | — | `public LayoutRuleMaximumSpacing ( double spacing )` |
| Property | Spacing | — | `public double Spacing { get ; set ; }` |